[Rainmeter]
Update=100
BackgroundMode=1
SolidColor=0F1419
; для того чтобы LUA скрипт мог знать, загружен ли этот скин 
; (So that the LUA script can know if this skin is loaded):
; OnRefreshAction=[!SetVariable "OmniCalColorActive" "1" "GoogleCalendar"]
; OnCloseAction=[!SetVariable "OmniCalColorActive" "0" "#GoogleCalendar#"]

[Metadata]
Name=OmniCal
Author=⊰SK⊱
Version=v3.5
License=Creative Commons BY-NC-SA 3.0
Information=Настройка цвета темы календаря OmniCal (OmniCal Theme Color Settings)


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Подключение Variables ~ (Variables inclusion)
    
    [Variables]
    @Include=#@#Variables.ini
    @Include1=#@#Variables_URL.ini

    ; Подключение файла темы (Theme file inclusion)
    ; Не менять вручную! (Do not change manually!)
        pathColorTheme=#@#Variables_Theme_#Theme#.ini
        @Include2=#pathColorTheme#

    @Include3=#@#Variables_ColorSettings.ini



;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; SettingsPanel StyleText

    [SettingsPanel_StyleText]
    FontColor=230,230,230,255
    FontSize=#CSP_FontSize#
    FontFace=#FontName#
    FontWeight=300
    AntiAlias=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Подключение 'ColorSelector' к скину  ~ (Connecting 'ColorSelector' to the skin)
    [ColorSelector_Start_Script]
    Measure=Script
    ScriptFile=#ROOTCONFIGPATH#\ColorSelector\@Resources\ColorSelector_Start.lua

    [ColorPath]
    Measure=String
    String=#pathColorTheme#
    UpdateDivider=-1
    OnUpdateAction=[!CommandMeasure "ColorSelector_Start_Script" "SetColorThemePath('#pathColorTheme#')"]

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Фон панели 'Настройка цвета' ~ (Color Settings Panel BG)
    [Measure_ColorSettingsPanelBG_RGBA] ; Взять ColorBg и заменить альфа канал на 255 ~ (Take ColorBg and replace alpha channel with 255)
    Measure=String
    String=[#ColorBg]
    RegExpSubstitute=1
    Substitute=",5$":"","^(\d+,\d+,\d+),.*$":"\1,255"
    DynamicVariables=1

    [ColorSettingsPanelBG] 
    Meter=Shape
    X=0
    Y=0
    Shape=Rectangle 0,0,#ColorSettingsPanel_W#,#ColorSettingsPanel_H#,5 | Fill Color [Measure_ColorSettingsPanelBG_RGBA] | StrokeWidth 1 | Stroke Color #SettingsPanelStrokeColor#
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Тема | КНОПКА Сброс темы | КНОПКА Встроенный цвет ~ (Theme | Embedded Color Button)
    
    [Theme]  ; Текст Тема ~ (Theme Text)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    FontSize=(#CSP_FontSize#+1)
    FontWeight=600
    X=#PaddingL#
    Y=15
    Text=[#Str_Theme_[#Language]] 
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel


    [ResetThemeButton]  ; КНОПКА Сброс темы к настройкам по умолчанию ~ (RESET THEME TO DEFAULT SETTINGS BUTTON)
    Meter=Button
    ButtonImage=#@#Images\btn_ResetTheme.png
    X=(#PaddingL#+#W_Cal_BG#+#Margin0#)
    ; X=(#PaddingL#+[Theme:W]+(#Margin0#*2))
    ; X=(#ColorSettingsPanel_W#-#W_Cal_FadedBG#-(#PaddingL#*2)-#Margin0#)
    ; X=(#ColorSettingsPanel_W#-90)
    Y=2
    DynamicVariables=1
    ; LeftMouseUpAction=[!DeactivateConfig]
    MouseOverAction=[!SetOption Tooltips_Text Text "[#Str_ResetThemeButton_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    ; Hidden=0
    ; Group=ColorSettingsPanel


    [CloseButton]  ; КНОПКА Встроенный цвет ~ (Close Button)
    Meter=Button
    ButtonImage=#@#Images\close.png
    X=(#ColorSettingsPanel_W#-40)
    Y=1
    DynamicVariables=1
    LeftMouseUpAction=[!DeactivateConfig]
    MouseOverAction=[!Redraw]
    MouseLeaveAction=[!Redraw]
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;▆▆▆[Блок-1] ~ [Block-1]▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Вычисление координат для Блока-1 ~ (Calculating coordinates for Block-1)

    [EventFaded_Hidden]  ; Текст 'ПРОШЕДШЕЕ'-скрытый. Для получения ширины текста. ~ (Text 'PAST'-hidden. To get the width of the text.)
    Meter=String
    X=0
    Y=0
    Text=[#Str_EventFaded_[#Language]]
    Padding=5,0,5,0
    FontColor=0,0,0,0
    FontSize=10
    FontFace=Arial
    AntiAlias=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [MeasureEventFaded_W]
    Measure=Calc
    Formula=[EventFaded_Hidden:W]+#Margin0#
    OnUpdateAction=[!SetVariable W_Cal_FadedBG "[MeasureEventFaded_W]"]
    DynamicVariables=1

    [MeasureEvent_W]
    Measure=Calc
    Formula=(#ColorSettingsPanel_W#-#W_Cal_FadedBG#-(#PaddingL#*2)-#Margin0#)
    OnUpdateAction=[!SetVariable W_Cal_BG "[MeasureEvent_W]"]
    DynamicVariables=1


    [MeasureEventFaded_X]
    Measure=Calc
    Formula=(#PaddingL#+#W_Cal_BG#+#Margin0#)
    OnUpdateAction=[!SetVariable CalFadedBG_X "[MeasureEventFaded_X]"]
    DynamicVariables=1

    [MeasureEventFadedTxt_X]
    Measure=Calc
    Formula=(#CalFadedBG_X#+(#W_Cal_FadedBG#/2))
    OnUpdateAction=[!SetVariable EventFadedTxt_X "[MeasureEventFadedTxt_X]"]
    DynamicVariables=1



    [Calc_Cal_TextX]  ; Выч коорд 'Х' для ИМЯ КАЛЕНДАРЯ, СОБЫТИЕ, КНОПКА Встроенный цвет ~ (Calc coord 'X' for CALENDAR NAME, EVENT, BUTTON Embedded color)
    Measure=Calc
    Formula=(#PaddingL# + (#PaddingL#/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Cal_TextX "[Calc_Cal_TextX]"]
    UpdateDivider=-1

    [CalcEventButton_X]  ; Выч коорд 'Х' для ИМЯ КАЛЕНДАРЯ, СОБЫТИЕ, КНОПКА Встроенный цвет ~ (Calc coord 'X' for CALENDAR NAME, EVENT, BUTTON Embedded color)
    Measure=Calc
    Formula=(#PaddingL#+#W_Cal_BG#-[EventButton_1:W]-5)
    DynamicVariables=1
    OnUpdateAction=[!SetVariable EventButton_X "[CalcEventButton_X]"]
    UpdateDivider=-1

    [Calc_Event_X]  ; Выч коорд 'Х' для ИМЯ КАЛЕНДАРЯ, СОБЫТИЕ, КНОПКА Встроенный цвет ~ (Calc coord 'X' for CALENDAR NAME, EVENT, BUTTON Embedded color)  
    Measure=Calc
    Formula=(#PaddingL#+#W_Cal_BG#-[EventButton_1:W]-10)
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Event_X "[Calc_Event_X]"]
    UpdateDivider=-1
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 1      | Календарь 1 ~ (Row 1 | Calendar 1)

    [CalFadedBG_1]  ; Фон ПРОШЕДШЕЕ ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=#PaddingT#
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_1_Bg_Faded# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_1_Bg_Faded')"]
    MouseOverAction=[!SetOption CalFadedBG_1 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_1 FontWeight 600][!UpdateMeter EventFaded_1][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_1 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_1 FontWeight 300][!UpdateMeter EventFaded_1][!Redraw]
    DynamicVariables=1

    [CalcRow1_TextY]  ; Вычисл Row1_TextY координата центра текста для центрирования ~ (Calc Row1_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_1:Y] + ([CalFadedBG_1:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row1_TextY "[CalcRow1_TextY]"] 
    UpdateDivider=-1

    [EventFaded_1]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row1_TextY#
    ; Text=#Str_EventFaded#
    Text=[#Str_EventFaded_[#Language]] 
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_1 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_1_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_1 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1

    ; --------------------------

    [CalBG_1]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=#PaddingT#
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_1_Bg# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_1 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_1_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_1_Bg')"]
    DynamicVariables=1

    [TxtCal_1]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row1_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar1_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0

    [Event_1]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row1_TextY#
    Text=[#Str_Event_[#Language]]
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!SetOption Event_1 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_1_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!SetOption Event_1 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtEvent')"]

    [EventButton_1]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_1#.png
    X=#EventButton_X#
    Y=(#Row1_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!SetOption TxtCal_1 ClipString 1][!SetOption Event_1 FontWeight 600][!SetOption Event_1 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_1][!UpdateMeter Event_1][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!SetOption TxtCal_1 ClipString 0][!SetOption Event_1 FontWeight 300][!SetOption Event_1 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_1][!UpdateMeter Event_1][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    ; LeftMouseUpAction=[!CommandMeasure OmniCal_Skin_lua "функция()"] ; TODO: позже дописать

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 2      | Календарь 2 ~ (Row 2 | Calendar 2)

    [CalFadedBG_2]  ; Фон ПРОШЕДШЕЕ ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=([CalBG_1:Y]+[CalBG_1:H]+#BlockMargin#)
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_2_Bg_Faded# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_2_Bg_Faded')"]
    MouseOverAction=[!SetOption CalFadedBG_2 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_2 FontWeight 600][!UpdateMeter EventFaded_2][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_2 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_2 FontWeight 300][!UpdateMeter EventFaded_2][!Redraw]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [CalcRow2_TextY]  ; Вычисл Row2_TextY координата центра текста для центрирования ~ (Calc Row2_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_2:Y] + ([CalFadedBG_2:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row2_TextY "[CalcRow2_TextY]"] 
    UpdateDivider=-1

    [EventFaded_2]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row2_TextY#
    ; Text=#Str_EventFaded#
    Text=[#Str_EventFaded_[#Language]] 
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_2 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_2_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_2 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1



    [CalBG_2]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=([CalBG_1:Y]+[CalBG_1:H]+#BlockMargin#)
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_2_Bg# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_2 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_2_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_2_Bg')"]
    DynamicVariables=1


    [TxtCal_2]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row2_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar2_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Event_2]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row2_TextY#
    Text=[#Str_Event_[#Language]]
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!SetOption Event_2 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_2_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!SetOption Event_2 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtEvent')"]


    [EventButton_2]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_2#.png
    X=#EventButton_X#
    Y=(#Row2_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!SetOption TxtCal_2 ClipString 1][!SetOption Event_2 FontWeight 600][!SetOption Event_2 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_2][!UpdateMeter Event_2][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!SetOption TxtCal_2 ClipString 0][!SetOption Event_2 FontWeight 300][!SetOption Event_2 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_2][!UpdateMeter Event_2][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    ; LeftMouseUpAction=[!CommandMeasure OmniCal_Skin_lua "функция()"] ; TODO: позже дописать

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 3      | Календарь 3 ~ (Row 3 | Calendar 3)

    [CalFadedBG_3]  ; Фон ПРОШЕДШЕЕ  ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=([CalBG_2:Y]+[CalBG_2:H]+#BlockMargin#)
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_3_Bg_Faded# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_3_Bg_Faded')"]
    MouseOverAction=[!SetOption CalFadedBG_3 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_3 FontWeight 600][!UpdateMeter EventFaded_3][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_3 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_3 FontWeight 300][!UpdateMeter EventFaded_3][!Redraw]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [CalcRow3_TextY]  ; Вычисл Row3_TextY координата центра текста для центрирования    ~ (Calc Row3_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_3:Y] + ([CalFadedBG_3:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row3_TextY "[CalcRow3_TextY]"] 
    UpdateDivider=-1

    [EventFaded_3]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row3_TextY#
    ; Text=#Str_EventFaded#
    Text=[#Str_EventFaded_[#Language]] 
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_3 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_3_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_3 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1



    [CalBG_3]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=([CalBG_2:Y]+[CalBG_2:H]+#BlockMargin#)
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_3_Bg# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_3 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_3_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_3_Bg')"]
    DynamicVariables=1


    [TxtCal_3]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row3_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar3_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Event_3]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row3_TextY#
    Text=[#Str_Event_[#Language]]
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!SetOption Event_3 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_3_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!SetOption Event_3 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtEvent')"]


    [EventButton_3]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_3#.png
    X=#EventButton_X#
    Y=(#Row3_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!SetOption TxtCal_3 ClipString 1][!SetOption Event_3 FontWeight 600][!SetOption Event_3 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_3][!UpdateMeter Event_3][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!SetOption TxtCal_3 ClipString 0][!SetOption Event_3 FontWeight 300][!SetOption Event_3 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_3][!UpdateMeter Event_3][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    ; LeftMouseUpAction=[!CommandMeasure OmniCal_Skin_lua "функция()"] ; TODO: позже дописать

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 4      | Календарь 4 ~ (Row 4 | Calendar 4)

    [CalFadedBG_4]  ; Фон ПРОШЕДШЕЕ ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=([CalBG_3:Y]+[CalBG_3:H]+#BlockMargin#)
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_4_Bg_Faded# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_4_Bg_Faded')"]
    MouseOverAction=[!SetOption CalFadedBG_4 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_4 FontWeight 600][!UpdateMeter EventFaded_4][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_4 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_4 FontWeight 300][!UpdateMeter EventFaded_4][!Redraw]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [CalcRow4_TextY]  ; Вычисл Row4_TextY координата центра текста для центрирования    ~ (Calc Row4_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_4:Y] + ([CalFadedBG_4:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row4_TextY "[CalcRow4_TextY]"] 
    UpdateDivider=-1

    [EventFaded_4]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row4_TextY#
    ; Text=#Str_EventFaded#
    Text=[#Str_EventFaded_[#Language]] 
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_4 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_4_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_4 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1



    [CalBG_4]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=([CalBG_3:Y]+[CalBG_3:H]+#BlockMargin#)
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_4_Bg# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_4 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_4_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_4_Bg')"]
    DynamicVariables=1


    [TxtCal_4]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row4_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar4_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Event_4]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row4_TextY#
    Text=[#Str_Event_[#Language]]
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!SetOption Event_4 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_4_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!SetOption Event_4 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtEvent')"]


    [EventButton_4]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_4#.png
    X=#EventButton_X#
    Y=(#Row4_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!SetOption TxtCal_4 ClipString 1][!SetOption Event_4 FontWeight 600][!SetOption Event_4 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_4][!UpdateMeter Event_4][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!SetOption TxtCal_4 ClipString 0][!SetOption Event_4 FontWeight 300][!SetOption Event_4 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_4][!UpdateMeter Event_4][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    ; LeftMouseUpAction=[!CommandMeasure OmniCal_Skin_lua "функция()"] ; TODO: позже дописать

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 5      | Календарь 5 ~ (Row 5 | Calendar 5)

    [CalFadedBG_5]  ; Фон ПРОШЕДШЕЕ ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=([CalBG_4:Y]+[CalBG_4:H]+#BlockMargin#)
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_5_Bg_Faded# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_5_Bg_Faded')"]
    MouseOverAction=[!SetOption CalFadedBG_5 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_5 FontWeight 600][!UpdateMeter EventFaded_5][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_5 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_5 FontWeight 300][!UpdateMeter EventFaded_5][!Redraw]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [CalcRow5_TextY]  ; Вычисл Row5_TextY координата центра текста для центрирования ~ (Calc Row5_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_5:Y] + ([CalFadedBG_5:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row5_TextY "[CalcRow5_TextY]"] 
    UpdateDivider=-1

    [EventFaded_5]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row5_TextY#
    ; Text=#Str_EventFaded#
    Text=[#Str_EventFaded_[#Language]] 
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_5 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_5_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_5 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1



    [CalBG_5]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=([CalBG_4:Y]+[CalBG_4:H]+#BlockMargin#)
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_5_Bg# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_5 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_5_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_5_Bg')"]
    DynamicVariables=1


    [TxtCal_5]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row5_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar5_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Event_5]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row5_TextY#
    Text=[#Str_Event_[#Language]]
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!SetOption Event_5 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_5_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!SetOption Event_5 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtEvent')"]


    [EventButton_5]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_5#.png
    X=#EventButton_X#
    Y=(#Row5_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!SetOption TxtCal_5 ClipString 1][!SetOption Event_5 FontWeight 600][!SetOption Event_5 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_5][!UpdateMeter Event_5][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!SetOption TxtCal_5 ClipString 0][!SetOption Event_5 FontWeight 300][!SetOption Event_5 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_5][!UpdateMeter Event_5][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    ; LeftMouseUpAction=[!CommandMeasure OmniCal_Skin_lua "функция()"] ; TODO: позже дописать

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;▆▆▆[Блок-2] ~ [Block-2]▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Вычисления координат колонок ~ (Calculations of column coordinates)

    [Calc_Col2_X]  ; Вычисл Col2_X ~ (Calc Col2_X)
    Measure=Calc
    Formula=((#ColorSettingsPanel_W#/2)-#PaddingL#-(#ColorSettingsPanel_W#/7)-5)
    ; Formula=150
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Col2_X "[Calc_Col2_X]"] 
    UpdateDivider=-1

    [Calc_Col3_X]  ; Вычисл Col3_X ~ (Calc Col3_X)
    Measure=Calc
    Formula=((#ColorSettingsPanel_W#/2)+5)
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Col3_X "[Calc_Col3_X]"] 
    UpdateDivider=-1

    [Calc_Col4_X]  ; Вычисл Col4_X  ~ (Calc Col4_X)
    Measure=Calc
    Formula=(#ColorSettingsPanel_W#-#PaddingL#-((#ColorSettingsPanel_W#/7)))
    ; Formula=350
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Col4_X "[Calc_Col4_X]"] 
    UpdateDivider=-1

    [Calc_Rectangle1_W]  ; Вычисл ширину Rectangle1 ~ (Calc Rectangle1 width)
    Measure=Calc
    Formula=(#ColorSettingsPanel_W#/7)
    ; Formula=350
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Rectangle1_W "[Calc_Rectangle1_W]"] 
    UpdateDivider=-1

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 6      | Линия часа         | Линия получаса       ~ (Row 6 | Hour line    | Half-hour line)

    [CalcRow6_TextY]  ; Вычисл Row6_TextY координата центра текста для центрирования
    Measure=Calc
    Formula=([Row_6_Col_2_Rectangle:Y] + ([Row_6_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row6_TextY "[CalcRow6_TextY]"] 
    UpdateDivider=-1

    [Row_6_Col_1_Text]  ;Линия часа  ~ (Hour line)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row6_TextY#
    Text=[#Str_HourLine_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_6_Col_2_Rectangle] 
    Meter=Shape
    X=#Col2_X#
    Y=([CalBG_5:Y]+[CalBG_5:H]+(#BlockMargin#*3)+10)
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineH1# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_6_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_6_Col_1_Text FontWeight 600][!UpdateMeter Row_6_Col_1_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_6_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_6_Col_1_Text FontWeight 300][!UpdateMeter Row_6_Col_1_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorLineH1')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_6_Col_3_Text]  ;Линия получаса ~ (Half-hour line)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row6_TextY#
    Text=[#Str_HalfHourLine_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_6_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([CalBG_5:Y]+[CalBG_5:H]+(#BlockMargin#*3)+10)
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineH2# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_6_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_6_Col_3_Text FontWeight 600][!UpdateMeter Row_6_Col_3_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_6_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_6_Col_3_Text FontWeight 300][!UpdateMeter Row_6_Col_3_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorLineH2')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 7      | Линия заголовка    | Вертикальные линии   ~ (Row 7 | Header line  | Vertical Lines)

    [CalcRow7_TextY]  ; Вычисл Row7_TextY координата центра текста для центрирования ~ (Calc Row7_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_7_Col_2_Rectangle:Y] + ([Row_7_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row7_TextY "[CalcRow7_TextY]"] 
    UpdateDivider=-1

    [Row_7_Col_1_Text]  ;Заголовок ~ (Header)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row7_TextY#
    Text=[#Str_HeaderLine_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_7_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_6_Col_2_Rectangle:Y]+[Row_6_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineH0# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_7_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_7_Col_1_Text FontWeight 600][!UpdateMeter Row_7_Col_1_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_7_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_7_Col_1_Text FontWeight 300][!UpdateMeter Row_7_Col_1_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorLineH0')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_7_Col_3_Text]  ;Выходные ~ (Weekends)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row7_TextY#
    Text=[#Str_VerticalLines_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_7_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_6_Col_2_Rectangle:Y]+[Row_6_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineVertH1# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_7_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_7_Col_3_Text FontWeight 600][!UpdateMeter Row_7_Col_3_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_7_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_7_Col_3_Text FontWeight 300][!UpdateMeter Row_7_Col_3_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorLineVertH1')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 7_1    | Разделительная линия ~ (Row 7_1 | Divider line)   

    [Row_7_1]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_7_Col_2_Rectangle:Y]+[Row_7_Col_2_Rectangle:H]+(#BlockMargin#*2))
    ; Y=200
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),1,0 | Fill Color #ColorLineH1# | StrokeWidth 0 | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=0

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 8*     | Заголовок          | Выходные             ~ (Row 8 | Header       | Weekends)

    [CalcRow8_TextY]  ; Вычисл Row7_TextY координата центра текста для центрирования ~ (Calc Row7_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_8_Col_2_Rectangle:Y] + ([Row_8_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row8_TextY "[CalcRow8_TextY]"] 
    UpdateDivider=-1

    [Row_8_Col_1_Text]  ;Заголовок ~ (Header)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row8_TextY#
    Text=[#Str_Header_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_8_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_7_Col_2_Rectangle:Y]+[Row_7_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTxtH1# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_8_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_8_Col_1_Text FontWeight 600][!UpdateMeter Row_8_Col_1_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_8_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_8_Col_1_Text FontWeight 300][!UpdateMeter Row_8_Col_1_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtH1')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_8_Col_3_Text]  ;Выходные ~ (Weekends)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row8_TextY#
    Text=[#Str_HeaderWeekend_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_8_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_7_Col_2_Rectangle:Y]+[Row_7_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTxtH1_Weekend# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_8_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_8_Col_3_Text FontWeight 600][!UpdateMeter Row_8_Col_3_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_8_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_8_Col_3_Text FontWeight 300][!UpdateMeter Row_8_Col_3_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtH1_Weekend')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 9      | Время              | Текущ время          ~ (Row 9 | Time         | CurrentTime)

    [CalcRow9_TextY]  ; Вычисл Row8_TextY координата центра текста для центрирования ~ (Calc Row8_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_9_Col_2_Rectangle:Y] + ([Row_9_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row9_TextY "[CalcRow9_TextY]"] 
    UpdateDivider=-1

    [Row_9_Col_1_Text]  ;Время ~ (Time)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row9_TextY#
    Text=[#Str_TimeLabels_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_9_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_8_Col_2_Rectangle:Y]+[Row_8_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTtmeTxt# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_9_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_9_Col_1_Text FontWeight 600][!UpdateMeter Row_9_Col_1_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_9_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_9_Col_1_Text FontWeight 300][!UpdateMeter Row_9_Col_1_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTtmeTxt')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_9_Col_3_Text]  ;Текущее время ~ (Current Time)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row9_TextY#
    Text=[#Str_CurrentTime_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_9_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_8_Col_2_Rectangle:Y]+[Row_8_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorCurrTime# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_9_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_9_Col_3_Text FontWeight 600][!UpdateMeter Row_9_Col_3_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_9_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_9_Col_3_Text FontWeight 300][!UpdateMeter Row_9_Col_3_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorCurrTime')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 9_1    | Разделительная линия ~ (Row 9_1 | Divider line)

    [Row_9_1]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_9_Col_2_Rectangle:Y]+[Row_9_Col_2_Rectangle:H]+(#BlockMargin#*2))
    ; Y=200
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),1,0 | Fill Color #ColorLineH1# | StrokeWidth 0 | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=0

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 10*    | Разделитель 1      | Разделитель 2        ~ (Row 10 | Separator 1  | Separator 2) 

    [CalcRow10_TextY]  ; Вычисл Row9_TextY координата центра текста для центрирования ~ (Calc Row9_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_10_Col_2_Rectangle:Y] + ([Row_10_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row10_TextY "[CalcRow10_TextY]"] 
    UpdateDivider=-1

    [Row_10_Col_1_Text]  ;Разделитель 1 ~ (Separator 1)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row10_TextY#
    Text=[#Str_Separator1_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_10_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_9_Col_2_Rectangle:Y]+[Row_9_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorSeparator_1# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_10_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_10_Col_1_Text FontWeight 600][!UpdateMeter Row_10_Col_1_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_10_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_10_Col_1_Text FontWeight 300][!UpdateMeter Row_10_Col_1_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorSeparator_1')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_10_Col_3_Text]  ;Разделитель 2 ~ (Separator 2)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row10_TextY#
    Text=[#Str_Separator2_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_10_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_9_Col_2_Rectangle:Y]+[Row_9_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorSeparator_2# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_10_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_10_Col_3_Text FontWeight 600][!UpdateMeter Row_10_Col_3_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_10_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_10_Col_3_Text FontWeight 300][!UpdateMeter Row_10_Col_3_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorSeparator_2')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 11     | Зона времени 1     | Зона времени 2       ~ (Row 11 | Time zone 1  | Time zone 2) 

    [CalcRow11_TextY]  ; Вычисл Row10_TextY координата центра текста для центрирования ~ (Calc Row10_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_11_Col_2_Rectangle:Y] + ([Row_11_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row11_TextY "[CalcRow11_TextY]"] 
    UpdateDivider=-1

    [Row_11_Col_1_Text]  ;Зона времени 1 ~ (Time zone 1)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row11_TextY#
    Text=[#Str_TimeZone1_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_11_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_10_Col_2_Rectangle:Y]+[Row_10_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorDay# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_11_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_11_Col_1_Text FontWeight 600][!UpdateMeter Row_11_Col_1_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_11_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_11_Col_1_Text FontWeight 300][!UpdateMeter Row_11_Col_1_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorDay')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_11_Col_3_Text]  ;Зона времени 2 ~ (Time zone 2)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row11_TextY#
    Text=[#Str_TimeZone2_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_11_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_10_Col_2_Rectangle:Y]+[Row_10_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorDay2# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_11_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_11_Col_3_Text FontWeight 600][!UpdateMeter Row_11_Col_3_Text][!Redraw]
    MouseLeaveAction=[!SetOption Row_11_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_11_Col_3_Text FontWeight 300][!UpdateMeter Row_11_Col_3_Text][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorDay2')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 12     | Зона времени 3     | Основной фон         ~ (Row 12 | Time zone 3  | BG) 

    [CalcRow12_TextY]  ; Вычисл Row11_TextY координата центра текста для центрирования ~ (Calc Row11_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_12_Col_2_Rectangle:Y] + ([Row_12_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row12_TextY "[CalcRow12_TextY]"] 
    UpdateDivider=-1

    [Row_12_Col_1_Text]  ;Зона времени 3 ~ (Time zone 3)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row12_TextY#
    Text=[#Str_TimeZone3_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel


    [Row_12_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_11_Col_2_Rectangle:Y]+[Row_11_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorDay3# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_12_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_12_Col_1_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_TimeZone3_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_12_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_12_Col_1_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorDay3')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel


    [Row_12_Col_3_Text]  ;Основной фон ~ (BG)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row12_TextY#
    Text=[#Str_GridBackground_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel

    [Row_12_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_11_Col_2_Rectangle:Y]+[Row_11_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorBg# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_12_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_12_Col_3_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_GridBackground_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_12_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_12_Col_3_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorBg')"]
    DynamicVariables=1
    ; Hidden=0
    ; Group=ColorSettingsPanel


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 12_1   | Разделительная линия ~ (Row 12_1 | Divider line)

    [Row_12_1]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_12_Col_1_Text:Y]+[Row_12_Col_1_Text:H]+(#BlockMargin#*2))
    ; Y=200
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),1,0 | Fill Color #ColorLineH1# | StrokeWidth 0 | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=1
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 13     | Подсказки                                 ~ (Row 13 | Tooltips)

    [Row_13_Col_2_Rectangle]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_12_Col_2_Rectangle:Y]+[Row_12_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),(#RectangleH2#*1.4),#BordrRad# | Fill Color #ColorDay3# | StrokeWidth #StrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=1
    Group=ColorSettingsPanelTooltips


    [Tooltips_Text]  ;Подсказки ~ (Tooltips)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    FontWeight=600
    X=(#PaddingL#+[Row_13_Col_2_Rectangle:W]/2)
    Y=([Row_13_Col_2_Rectangle:Y] + ([Row_13_Col_2_Rectangle:H]/2))
    ; Text=[#Str_TimeZone3_[#Language]]
    Text=Подсказки
    StringAlign=CenterCenter
    Padding=5,0,5,0
    DynamicVariables=1
    Hidden=1
    Group=ColorSettingsPanelTooltips


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
    
    
    
    ; [ResetThemeButton2]  ; КНОПКА Сброс темы к настройкам по умолчанию ~ (RESET THEME TO DEFAULT SETTINGS BUTTON)
    ; Meter=Button
    ; ButtonImage=#@#Images\btn_ResetTheme1.png
    ; X=#PaddingL#
    ; Y=([Row_12_Col_2_Rectangle:Y]+[Row_12_Col_2_Rectangle:H]+(#BlockMargin#*4)+4)
    ; DynamicVariables=1
    ; ; LeftMouseUpAction=[!DeactivateConfig]
    ; MouseOverAction=[!SetOption Tooltips_Text Text "[#Str_ResetThemeButton_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    ; MouseLeaveAction=[!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    ; ; Hidden=0
    ; ; Group=ColorSettingsPanel




; [MeasureTextLength]
; Measure=String
; String=[#Str_EventFaded_[#Language]]
; FontFace=Arial
; FontSize=10
; MeterStyle=SettingsPanel_StyleText
; DynamicVariables=1

; ; [MeasureTextWidth]
; ; Measure=Calc
; ; Formula=[EventFaded_Hidden:W]+10
; ; DynamicVariables=1

; [TEST]
; Meter=String
; MeterStyle=SettingsPanel_StyleText
; X=10
; Y=600
; Text=#ROOTCONFIGPATH#
; DynamicVariables=1

; [TEST1]
; Meter=String
; MeterStyle=SettingsPanel_StyleText
; X=10
; Y=30r
; MeasureName=MeasureEventFaded_W
; DynamicVariables=1



